<?xml version="1.0" encoding="UTF-8"?>
    <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
        <plist version="1.0">
            
            <dict>
                <key>Description</key>
                    <string>Downloads SuperCollier and imports into Munki.</string>
                <key>Input</key>
            
                <dict>
                    <key>IDENTIFIER</key>
                        <string>com.github.ntownsend.recipes.SuperCollider</string>
                    <key>MUNKI_REPO_SUBDIR</key>
                        <string>supercollider</string>
                    <key>NAME</key>
                        <string>SuperCOllider</string>
                    <key>SOURCEFORGE_FILE_PATTERN</key>
                        <string>SuperCollider-[0-9_\.]*\.dmg</string>
                    <key>SOURCEFORGE_PROJECT_ID</key>
                        <string>54622</string>
                    <key>APP_DESTINATION</key>
                        <string>/Applications</string>
                    <key>pkginfo</key>
                    <dict>
                        <key>catalogs</key>
                            <array>
                                <string>testing</string>
                            </array>
                        <key>description</key>
                            <string>SuperCollider is an environment and programming language for real time audio synthesis and algorithmic composition. It provides an interpreted object-oriented language which functions as a network client to a state of the art, realtime sound synthesis server.</string>
                        <key>name</key>
                            <string>%NAME%</string>
                        <key>unattended_install</key>
                            <true/>
                    </dict>
                </dict>
            
                <key>Process</key>
                    <array>
                        <dict>
                            <key>Processor</key>
                                <string>SourceForgeURLProvider</string>
                        </dict> 
                        <dict>
                            <key>Processor</key>
                                <string>URLDownloader</string>
                            <key>Arguments</key>
                            <dict>
                                <key>filename</key>
                                    <string>%NAME%.dmg</string>
                            </dict>
                        </dict>
                        <dict>
                            <key>Processor</key>
                                <string>EndOfCheckPhase</string>
                        </dict>
                        <dict>
                            <key>Arguments</key>
                                <dict>
                                    <key>pkg_path</key>
                                        <string>%pathname%</string>
                                    <key>repo_subdirectory</key>
                                        <string>%MUNKI_REPO_SUBDIR%</string>
                                    <key>additional_makepkginfo_options</key>
                                        <array>
                                            <string>destinationpath</string>
                                            <string>%APP_DESTINATION%</string>
                                        </array>
                                </dict>
                            <key>Processor</key>
                                <string>MunkiImporter</string>
                        </dict>
                    </array>
            </dict>
        </plist>


